<a href="https://colab.research.google.com/github/thien1892/Skill_for_Data_Scientist_with_Python/blob/main/Importing_Data_with_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
cd /content/drive/MyDrive/Data_scientist_with_python/Dataset/Introduction to Importing Data in Python/

/content/drive/MyDrive/Data_scientist_with_python/Dataset/Introduction to Importing Data in Python

# 1. Load text file
## 1.1. Reading a text file

In [ ]:
filename = 'William Shakespeare.txt'
file = open(filename, mode='r') # 'r' is to read
text = file.read()
file.close()

In [ ]:
print(text)

William Shakespeare (bapt. 26 April 1564 â€“ 23 April 1616)[a] was an English playwright, poet, and actor, widely regarded as
 the greatest writer in the English language and the world's greatest dramatist.[2][3][4] He is often called England's
 national poet and the "Bard of Avon" (or simply "the Bard").[5][b] His extant works, including collaborations,
consist of some 39 plays,[c] 154 sonnets, three long narrative poems, and a few other verses, some of uncertain authorship.
 His plays have been translated into every major living language and are performed more often than those of any other
 playwright.[7] They also continue to be studied and reinterpreted.

## 1.2. Writing to a file

In [ ]:
filename = 'hello.txt'
file = open(filename, mode='w') # 'w' is to write
file.write('hello \n my name is thien')
file.close()

## 1.3. Context manager with

In [ ]:
with open( 'hello.txt' , 'r') as file:
  print(file.read())

hello
 my name is thien

# 2. Read csv file

In [2]:
import pandas as pd
df = pd.read_csv('titanic_sub.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0            1         0       3  ...   7.2500    NaN         S
1            2         1       1  ...  71.2833    C85         C
2            3         1       3  ...   7.9250    NaN         S
3            4         1       1  ...  53.1000   C123         S
4            5         0       3  ...   8.0500    NaN         S

[5 rows x 11 columns]

## 3. Read excel spreadsheet

In [4]:
import pandas as pd
file = 'battledeath.xlsx'
data = pd.ExcelFile(file)
# list of sheet in file
print(data.sheet_names)

['2002', '2004']

In [5]:
df1 = data.parse('2002')
# or df1 = data.parse(0)
df1.head()

  War, age-adjusted mortality due to       2002
0                        Afghanistan  36.083990
1                            Albania   0.128908
2                            Algeria  18.314120
3                            Andorra   0.000000
4                             Angola  18.964560

In [6]:
df2 = pd.read_excel(file, sheet_name= '2002')
df2.head()

  War, age-adjusted mortality due to       2002
0                        Afghanistan  36.083990
1                            Albania   0.128908
2                            Algeria  18.314120
3                            Andorra   0.000000
4                             Angola  18.964560

# 4. Read SQL

In [7]:
from sqlalchemy import create_engine
engine = create_engine('sqlite:///Chinook.sqlite')

# getting table name
table_names = engine.table_names()
print(table_names)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:5: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  """

['Album', 'Artist', 'Customer', 'Employee', 'Genre', 'Invoice', 'InvoiceLine', 'MediaType', 'Playlist', 'PlaylistTrack', 'Track']

In [8]:
con = engine.connect()
rs = con.execute("SELECT * FROM Album")
df = pd.DataFrame(rs.fetchall())
df.columns = rs.keys()
con.close()

df.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [9]:
with engine.connect() as con:
  rs = con.execute("SELECT * FROM Album")
  df = pd.DataFrame(rs.fetchmany(size=5))
  df.columns = rs.keys()

df

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [10]:
df = pd.read_sql_query("SELECT * FROM Album", engine)
df.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

# 5. Import file download in python

In [11]:
from urllib.request import urlretrieve
url = 'http://archive.ics.uci.edu/ml/machine-learning-databases/wine-quality/winequality-white.csv'
urlretrieve(url, 'winequality-white.csv')

('winequality-white.csv', <http.client.HTTPMessage at 0x7f565051a650>)

In [13]:
df = pd.read_csv('winequality-white.csv', delimiter= ';')
df.head()

   fixed acidity  volatile acidity  citric acid  ...  sulphates  alcohol  quality
0            7.0              0.27         0.36  ...       0.45      8.8        6
1            6.3              0.30         0.34  ...       0.49      9.5        6
2            8.1              0.28         0.40  ...       0.44     10.1        6
3            7.2              0.23         0.32  ...       0.40      9.9        6
4            7.2              0.23         0.32  ...       0.40      9.9        6

[5 rows x 12 columns]

# 6. Loading JSONs in Python
## 6.1. Read JSONs

In [16]:
import json
with open('data.json', 'r') as json_file:
  json_data = json.load(json_file)

for key, value in json_data.items():
  print(key + ':', value)

Actors: Samuel L. Jackson, Julianna Margulies, Nathan Phillips, Rachel Blanchard
Awards: 3 wins & 7 nominations.
Country: Germany, USA, Canada
Director: David R. Ellis
Genre: Action, Adventure, Crime
Language: English
Rated: R
Released: 18 Aug 2006
Runtime: 105 min
Title: Snakes on a Plane
Type: movie
Writer: John Heffernan (screenplay), Sebastian Gutierrez (screenplay), David Dalessandro (story), John Heffernan (story)
Year: 2006
imdbID: tt0417148
imdbRating: 5.6
imdbVotes: 114,668

##6.2. Write JSONs

In [14]:
data = {'Actors': 'Samuel L. Jackson, Julianna Margulies, Nathan Phillips, Rachel Blanchard',
'Awards': '3 wins & 7 nominations.',
'Country': 'Germany, USA, Canada',
'Director': 'David R. Ellis',
'Genre': 'Action, Adventure, Crime',
'Language': 'English',
'Rated': 'R',
'Released': '18 Aug 2006',
'Runtime': '105 min',
'Title': 'Snakes on a Plane',
'Type': 'movie',
'Writer': 'John Heffernan (screenplay), Sebastian Gutierrez (screenplay), David Dalessandro (story), John Heffernan (story)',
'Year': '2006',
'imdbID': 'tt0417148',
'imdbRating': '5.6',
'imdbVotes': '114,668'}

In [17]:
with open('data.json', 'w') as f:
    json.dump(data, f)
# with open('data.json', 'w', encoding='utf-8') as f:
#     json.dump(data, f, ensure_ascii=False, indent=4)